{
    "01" : "We're America - Why Apple's CEO thinks we can have both encryption and national security",
    "02" : "Apple CEO Tim Cook remains a strong supporter of encryption, even as governments continue to question the method of securely gathering data in wake of terrorist attacks.",
    "03" : "To Cook, it doesn't have to be one or the other.",
    "04" : "\"I don’t believe that the tradeoff here is privacy versus national security,\" Cook said during an interview on \"60 Minutes\".",
    "05" : "\"We’re America. We should have both.\"",
    "06" : "People are using their iPhones to store private sensitive information, like their health and finances. Even conversations with friends or confidential business secrets should be able to be stored securely on an iPhone, Cook believes.",
    "07" : "\"You should have the ability to protect it. And the only way we know how to do that is to encrypt,\" Cook said.",
    "08" : "The National Security Agency and government officials have been arguing that encryption was a matter of natural security — a trade-off Cook clearly doesn't buy. Government officials want Apple and other tech companies to install a \"backdoor\" for law agencies to be able to access and read encrypted messages.",
    "09" : "Right now, if a government agency gives Apple a proper warrant, they will hand over what they have. But if the information is encrypted, like private messages, Apple simply may not have the information to give them.",
    "10" : "Apple is happy to comply with the government's warrants, but it stops short of welcoming them into its users private, encrypted messages.",
    "11" : "\"The reality is that if you put a backdoor in, then it becomes a backdoor for everybody, good or bad,\" Cook said.",
    "11" : " ",
    "12" : "Government Can't Deny Trademarks Over Offensive Names, Appeals Court Rules",
    "13" : "An Asian-American rock-band with an eyebrow-raising name has scored a big victory in the Court of Appeals for the Federal Circuit.",
    "14" : "The court ruled that their name — The Slants — is private speech and therefore protected by the First Amendment. The government, the court writes, has no business trying to regulate it by denying the band a trademark.",
    "15" : "At issue in the case was Section 2(a) of the Lanham Act, which allows the U.S. Patent and Trademark Office (PTO) to deny or cancel a trademark if it is \"disparaging\" of persons, institutions or national symbols.",
    "16" : "In a 10-2 decision, the court decided parts of that section were unconstitutional. Conferring a trademark, the court argues, does not make the band's name government speech.",
    "17" : "Here's the comparison the majority uses - \"The PTO's processing of trademark registrations no more transforms private speech into government speech than when the government issues permits for street parades, copyright registration certificates, or, for that matter, grants medical, hunting, fishing, or drivers licenses, or records property titles, birth certificates, or articles of incorporation.\"",
    "18" : "The founder of the band, Simon Tam, has been fighting this battle for years. As our friend Kat Chow reported for Code Switch earlier this year, Tam understands that the name is offensive, but he views this as an opportunity to reclaim that slight.",
    "19" : "On Twitter, Tam said that the decision was \"the best present ever.\"",
    "20" : "In its conclusion, the court says it realizes that its decision could mean more registrations of offensive marks.",
    "21" : "\"But much the same can be (and has been) said of many decisions upholding First Amendment protection of speech that is hurtful or worse,\" the majority wrote. \"Whatever our personal feelings about the mark at issue here, or other disparaging marks, the First Amendment forbids government regulators to deny registration because they find the speech likely to offend others. Even when speech 'inflict[s] great pain,' our Constitution protects it 'to ensure that we do not stifle public debate.'\"",
    "22" : "A similar case concerning the trademark of the Washington Redskins name is under review by the 4th Circuit Court of Appeals.",
    "23" : "Rebecca Tushnet, a professor at Georgetown Law, said that this decision is headed to the Supreme Court one way or another.",
    "24" : "\"This is the first real, serious constitutional treatment of the issue,\" Tushnet said. And since the Lanham Act was passed in 1946, First Amendment law has changed quite a bit.",
    "25" : "For example, at the time when the Lanham Act was passed, there was no constitutional protection for commercial speech.",
    "26" : "The 4th Circuit, Tushnet says, will read this decision carefully but it's impossible to predict how they will rule.",
    "27" : "In a statement, Lee Rowland, an attorney with the American Civil Liberties Union, who argued before the court in October, praised the decision.",
    "28" : "\"Our First Amendment prevents the government from giving rights and benefits only to people engaged in the 'right kind' of speech, and that principle holds just as true in the trademark system,\" she said in a statement. \"It should be up to the public, not the government, to drive bad ideas from the marketplace.\"",
    "29" : " ",
    "30" : "Asian-American Band Fights To Trademark Name 'The Slants'",
    "31" : "The Slants, a six-member band from Portland, Ore., calls their sound \"Chinatown Dance Rock\" — a little bit New Order, a little bit Depeche Mode. They describe themselves as one of the first Asian-American rock bands. Their music caters to an Asian-American crowd, they've spoken at various Asian-American events, and they're proud of all of it.",
    "32" : "But the Slants have been duking it out with the United States Patent and Trademark Office (PTO) over the past four years because of their name. The PTO refused the band's two trademark applications, saying that \"slants\" is a disparaging term for people of Asian descent. Now the band plans to take their case to a federal circuit court.",
    "33" : "\"They said because of our ethnicity, people automatically think of the racial slur as opposed to any other definition of the term,\" Simon Tam, founder and bassist of The Slants, told me. \"In other words, if I was white, this wouldn't be an issue at all,\" Tam, who goes by \"Simon Young\" onstage, is of Taiwanese and Chinese descent. (The entire Slants crew is Asian-American.)",
    "34" : "(We reached out to the lawyer at the patent office; a spokesperson for the trademark office said he couldn't comment on pending cases.)",
    "35" : "Reclaiming A Word",
    "36" : "This isn't the first time groups have fought to trademark names that were ostensibly pejorative against them. The PTO rejected an application from a San Francisco motorcycle group called \"Dykes on Bikes,\" saying its name was \"disparaging to lesbians.\" But the federal patent office overturned that decision in 2005. (Three years later, the U.S. Court of Appeals rejected a \"men's rights\" advocate's argument that \"Dykes on Bikes\" was disparaging to men.)",
    "37" : "Similarly, Heeb Media's trademark application was refused in 2009 because its name, a variation of the slur \"hebe,\" was considered offensive to Jews.",
    "38" : "\"The most contentious case about trademarking slurs these days involves the Washington Redskins. But it differs from the Slants' case in a key way\" - \"Native American activists are petitioning the PTO, arguing that the football team's trademark should be revoked because it's offensive to Native Americans. (For more on trademarks and slurs — there's some fascinating stuff here — give this a read.)\"",
    "39" : "Under section 2(a) of the Lanham Act, trademark law prohibits registration of marks that are \"scandalous\" or \"immoral.\" The PTO uses a two-prong test (that actually stems from one of the earlier Redskins trademark battles) to see if a mark is disparaging\" - \"first, what is the likely meaning of the mark; and second, if that meaning refers to an identifiable group, is the meaning disparaging to a 'substantial composite' of that group?\"",
    "40" : "Some say that the law, which was enacted in 1946, doesn't always account for intent. Mark Lemley, a professor of intellectual property law at Stanford Law School and director of Stanford's Law, Science & Technology program, says it's ironic if that bit of trademark law affects people — especially minorities — who are trying to reclaim a phrase.",
    "41" : "\"I don't think anybody who wrote the act in 1946 had the idea that minority groups would be claiming these terms as a badge of honor and repurposing them,\" Lemley said.",
    "42" : "How The Arguments Went Down",
    "43" : "But let's backtrack a bit.",
    "44" : "When the band members said they were reclaiming the term in 2009, the case was refused by the patent office, which said the name was disparaging. (The officials cited internet sources, including Urban Dictionary and Wikipedia in their explanation.) Tam and his crew also argued that \"slant\" has many meanings, and that it's not necessarily derogatory in every context. The Slants have claimed that their name is a reference to musical chords. As part of their defense, they had two professors survey Asian-Americans around the country about the potential offensiveness — or lack thereof — of the name, and they also had Duke linguist Ronald Butters pen a report analyzing the word.",
    "45" : "But no dice. \"The intent of an applicant to disparage the referenced group is not necessary to find that the mark does, in fact, disparage that group,\" the trademark office ruled of the initial trademark application from 2009. Here's how Tam said he and the band responded:",
    "46" : "\"The term 'slant' means a lot of different things. And [the lawyer from the PTO] even acknowledged that, so [we asked], 'Why did you choose to apply the racial connotations to this application, but you've never done that before in the entire history of this country? Why this case?' And they said it was because I was Asian-American.\"",
    "47" : "\"So the Slants filed a second trademark case in 2011, but they changed tacks\" - \"this time, they argued that the name had nothing to do with anything Asian.",
    "48" : "But that, too, could be a tough sell, according to Lemley. \"Trademark law cares a lot about what consumers think, and so if the way people in the marketplace are likely to understand the term [is] as a reference to Asians, then that's the way trademark law will treat it,\" Lemley said. \"It may actually have another meaning, but if people don't recognize that meaning, it doesn't matter.\"",
    "49" : "Moving Forward",
    "50" : "\"As the Slants prepare to take their case to a federal circuit court, they're trying a different strategy\" - \"they're arguing that denying them the trademark violates their First Amendment rights.\"",
    "51" : "Parties arguing in trademark cases can't invoke freedom of speech; the PTO isn't saying the Slants can't call themselves that — they just can't have the name trademarked. But they hope the federal court sees things differently.",
    "52" : "\"It'll be slightly different in a federal court than in the trademark because we can bring some of the... other types of legal arguments that the USPTO doesn't consider,\" Tam said. \"Such as [the] First Amendment and... their reasoning using race as a consideration for the decision under the trademark office.... Under almost every other [form of] government, they can't do that because it's considered racist.\"",
    "53" : "That strategy might not be such a bad idea, according to Lemley, the Stanford intellectual property law professor.",
    "54" : "\"Were the band to sue the government and say, 'You've improperly denied me this benefit on the content of my speech,' I think they'd have a pretty good case,\" Lemley said.",
    "55" : "The Slants have been trying to trademark their name for nearly long as they've been around. You could argue that the fight has brought them as much attention — if not more — than their songs.",
    "56" : "\"[The name is] certainly a part of our group's identity and part of our music,\" Tam said. \"By the very nature of them regulating something like this in the marketplace, it hurts our ability to protect our band.\"",
    "57" : " ",
    "58" : "Tupac Shakur Biopic ‘All Eyez on Me’ Casts a Lead",
    "59" : "A new biopic about Tupac Shakur named after the rapper’s 1996 double album “All Eyez on Me” has cast its central role. Demetrius Shipp Jr., an inexperienced actor who resembles the ’90s hip-hop great, will play Shakur, who was killed in a drive-by shooting in Las Vegas in September 1996.",
    "60" : "Greg Mielcarz, a spokesman for the film studio Morgan Creek, confirmed the casting, which was broken by TMZ. Mr. Shipp has also been blasting out the news on social media, posting pictures on his Instagram of himself in character, including a snapshot with Jamal Woolard, who played Christopher Wallace (a.k.a. the Notorious B.I.G.) in the 2009 biopic “Notorious.” Mr. Woolard will reprise the role in the new film.",
    "63" : "Saul Williams in a scene from “Holler if Ya Hear Me,” a new Broadway musical that weaves songs and poetry from the rapper Tupac Shakur into its story.‘Holler if Ya Hear Me’ Uses Songs by Tupac ShakurJUNE 4, 2014",
    "64" : "F. Gary Gray, left, who directed \"Straight Outta Compton,\" and Dr. Dre at an after party in Los Angeles for the film's premiere on Monday.Straight Outta History, the Rage That Makes MoviesAUG. 11, 2015",
    "65" : "The music video director Benny Boom will helm “All Eyez on Me,” which had been hamstrung by production problems. Multiple directors were involved with the film before Mr. Boom, including John Singleton, the director of “Boyz N The Hood” and “Poetic Justice” (which starred Shakur); and Antoine Fuqua, who directed “Training Day” and “Southpaw.” Mr. Boom’s previous film credits include the 2009 comedy “Next Day Air.”",
    "66" : "Mr. Shipp has considerably less on-screen experience. “Trust me, he can act!” one of the film’s producers, L.T. Hutton, wrote on Facebook in a post that links to the TMZ report. “The thing was to find the full package, someone who had it all! Acting ability, looks and soul.”",
    "67" : "Mr. Shipp has been taking “intensive one-on-one lessons with acting coaches for more than a year,” Mr. Mielcarz said.",
    "68" : "Shakur is one of rap’s most recognizable figures, as well as a notable actor in his own right (in addition to “Poetic Justice,” his big-screen credits include 1992’s “Juice”). Since his death at the age of 25, he has become an icon, springing up, Elvis-like, on memorabilia and in conspiracy theories. He was portrayed by Marcc Rose in the 2015 film “Straight Outta Compton” and was the inspiration for a short-lived Broadway musical, “Holler if Ya Hear Me,” in 2014.",
    "69" : "“All Eyez on Me” is currently shooting in Atlanta, with plans to film until the end of January. No release date has been set.",
    "70" : "http://www.nytimes.com/2015/12/25/arts/tupac-shakur-biopic-all-eyez-on-me-casts-a-lead.html",
    "71" : " ",
    "72" : "I bought an iPhone because I'm not as sad as I used to be By T.C. Sottek",
    "73" : "I thought I’d never buy an iPhone, until I did. It was a Monday night and I was looking at my cheap Moto E, and realized I really didn’t like my phone. I got the E months ago because I had just destroyed a very expensive HTC One, and then a Nexus 5, and I felt a sense of regret I didn’t want to feel again. But it was a pleasant evening, so I took a walk to my neighborhood T-Mobile store, asked for an iPhone, and within 10 minutes I was on my way home. It was an impulsive decision, but it was a great decision, because I’m not as sad as I used to be.",
    "74" : "I am mostly tolerant of technology. Working for The Verge has probably accelerated my jaded attitude toward some things, but mostly, honestly, I just don’t care much about the newest version of Android or the latest smartwatch, even though I appreciate the human accomplishment in their creation. Part of that disposition is the passive accumulation of experience I’ve had, including being endlessly pitched on inane products that will ultimately fail on Kickstarter, but the other part has been an active effort to create meaningful distance between myself and the objects I use.",
    "75" : "Do you get a lot of notifications on your phone? I don’t. I mostly get the ones I can’t reasonably turn off, like phone calls and text messages. A while back, I intentionally decided my attention should not be controlled by an object in my pocket. That means I often don’t bring my phone with me at all when I’m going out to dinner with someone. And emails, tweets, Instagram likes — these are all still things I experience, but they never alert me to their existence. I experience them on my own time. The effect of this decision is that my life feels more deliberate, and the relationships I have often feel richer and more authentic.",
    "76" : "THE STORY I'VE TOLD MYSELF IS ONLY HALF TRUE",
    "77" : "\"At least, that’s the story I’ve told myself for years. That philosophy is great and has served me in some positive ways, but it’s only half of the truth. The other half is that for a long time, I’ve been a pretty sad person. I still am (and I probably will be for the rest of my life!), but I’ve learned how to deal with it, the same way you might learn how to deal with a chronic pain in your leg. Treating it like a condition to be overcome seems so obvious now, but it wasn’t before, because that’s how depression works\" - \"you think it’s the real you (because it is!), and you become skeptical, afraid even, of being happy, as if being happy is inauthentic. It makes you fearful of love. Depression is a devious partner who you can never leave, and who will co-opt your happiness for more suffering, if you let them. And it was so easy for me to let them.\"",
    "78" : "For a while, I reduced my involvement with technology, and even cut it off completely. But what I was really cutting off was people in my life. I left Facebook because I thought it was making me sad. And parts of it definitely were! There’s a lot of garbage on Facebook. But the really sad part was feeling inadequate, and never involved enough in the lives of people I cared about. Not seeing their lives play out made it easier to feel comfortable in my sadness.",
    "79" : "I BOUGHT A CHEAP PHONE BECAUSE IT FIT THE LIMITED WORLD I CREATED",
    "80" : "So buying a $150 Android phone I didn’t have to care about felt like a bold decision — a way to keep technology at arm's length. I thought it would be one less precious object in my life to fret over, and it was. I could still do everything I wanted to do in the limited world I created for myself — listen to music, call an Uber, check my email, whatever. The fact that it did all of these things adequately but not spectacularly wasn’t a problem, because I pushed myself in a direction where there was seldom any reason to use my phone in the ways most people probably do. I didn’t have lots of ongoing conversations across different apps, and I mostly didn’t use apps at all — because most apps worth using connect you to other people, and I just wasn’t connected to many people. It was okay for my phone to be slow and clunky because I resigned myself to a social death where there is no urgency to be alive.",
    "81" : "I bought an iPhone not because it makes me happy, though it is a beautiful object that I appreciate in many ways. I bought it because my family uses iPhones, and I haven’t been able to participate in their group iMessage conversations on Android. I can be closer to them now in a way I wasn’t before, even if that means being locked into Apple’s world for a little while. It’s also not really about the iPhone. I bought it because it’s a more capable device than what I had, and I wanted to start using Facebook again, and other things I’ve neglected, and (so far) it looks like this product is one of the best ways to experience those things.",
    "82" : "I still have most of my notifications turned off, but that’s okay. What matters is that I want to find people again, and be found. And one small way to do that is with a phone owned by the people I care about.",
    "83" : "http://www.theverge.com/2015/12/22/10650830/technology-and-my-depression",
    "84" : " ",
    "85" : "Court Ruling Brings 'The Slants' Closer to Trademarking Name by EMIL GUILLERMO",
    "86" : "Asian-American rock band The Slants moved one step closer to trademarking their name Tuesday after a ruling issued by the U.S. Court of Appeals for the Federal Circuit.",
    "87" : "The ruling states that the U.S. Patent and Trademark Office's blocking of the registration on grounds that the band's name was offensive was unconstitutional and a violation of the First Amendment.",
    "88" : "\"The government cannot refuse to register disparaging marks because it disapproves of the expressive messages conveyed by the marks,\" the majority opinion reads. \"It cannot refuse to register marks because it concludes that such marks will be disparaging to others. The government regulation…amounts to viewpoint discrimination.\"",
    "89" : "The Trademark office's use of the Lanham Act in the case did not survive \"strict scrutiny,\" the court said.",
    "90" : "\"Section 2a is a viewpoint-discriminatory regulation of speech, created and applied in order to stifle the use of certain disfavored messages,\" the opinion reads. \"Strict scrutiny therefore governs its First Amendment assessment—and no argument has been made that the measure survives such scrutiny.\"",
    "91" : "The court directed the case back to the Patent and Trademark Office for \"further proceedings.\"",
    "92" : "\"This is an incredible victory,\" Simon Tam, founder of The Slants, told NBC News. \"While we were anticipating a greater split, a 10-2 vote in our favor shows that the overwhelming majority of the judges in one of the country's most conservative courts believes that the law used against us is unconstitutional. Of course, there are some legal next steps to deal with, and the Trademark Office will likely appeal the decision, but right now it's facilitating an important discussion in law on culture, identity, language, and the role of free speech.\"",
    "93" : "Tam has fought six years in court to get trademark protection for the use of the band's name, his way of re-appropriating the term and using it positively. The Patent and Trademark Office, relying on a provision that blocks trademarking \"disparaging\" names, had twice rejected The Slants' application.",
    "94" : "He will now wait to see if the Trademark Office appeals to the Supreme Court.",
    "95" : "\"The Patent and Trademark Office found no other reason to deny registration, so unless the case is appealed to the Supreme Court, [The Slants leader Simon] Tam will get his registration,\" John Crittenden, a partner in Cooley LLP's litigation department and adjunct professor at UCLA Law, told NBC News.",
    "96" : "Crittenden said the ruling could also impact the fight of the Washington NFL football team to keep its name.",
    "97" : "\"It doesn't automatically mean that the Redskins can keep their trademark registrations,\" Crittenden said. \"That case, Pro-Football v. Blackhorse, is pending in a different circuit court, the U.S. Court of Appeals for the Fourth Circuit, and so the Tam decision isn't a binding precedent. But the Fourth Circuit will certainly look closely at what the Federal Circuit did in Tam - the decision it is reviewing relied heavily on the 1981 decision that the Tam court just overruled today, and the same constitutional arguments were made in both cases. The Fourth Circuit will probably consider today's decision 'persuasive' precedent'.\"",
"end" : "",
    "98" : " ",
    "099" : "yes Virginia, there is a left-wing reform movement by Freddie",
    "100" : "\"I was quoted in a couple prominent publications yesterday, repeating my complaints with Oberlin’s protest against the supposed cultural appropriation of bad cafeteria food. Predictably, this resulted in both a lot of praise and a lot of criticism on social media. I don’t take either too deeply to heart. But I am disappointed that, from both critics and supporters, this has resulted in a common refrain\" - \"that I must be something other than a leftist, that to differ with (for example) Oberlin college students on the question of cultural appropriation must mean that I’m a closet whatever.\"",
    "101" : "\"In fact, I critique that practice because I am on the left. I’m part of a small but growing collection of people who feel that the left has lost its way, and that it must be steered back to its traditional roots\" - \"in materialism, in class solidarity as the basis of political organizing, in recognizing that racism and sexism can only be meaningfully addressed through structural economic change, in privileging the material over the symbolic or the linguistic, and in defining our purpose as building a mass movement — and thus necessarily reaching out and convincing those who are not already convinced. This tendency is not a moderating or rightward-bearing tendency. In fact, most of the many people I know who participate in this reformist push believe that they are the true inheritors of the left-wing tradition, because they prefer the economic, material means of change common to historical socialist movements.\"",
    "102" : "The arguments against such a movement you could rehearse in your sleep.  Those inclined to defend the current rhetorical practice of the left insist that this a movement of cis het white male etc privilege, a retrenchment. That’s not true, actually. I know men and women, people of every race, gay and straight, trans and cisgender, and of every other facet of human diversity, who have deep reservations about the current habits of the American left and are desperate for a realist left movement that cares about winning and does what it takes to make winning more likely. I would name some individual names, but then I’m associating them with me, and I have no interest in forcing others to answer for my position. It’s enough to say that every day, I encounter more people who are convinced that contemporary left practice is a road to nowhere. Many of them are hesitant to be public with these complaints, because the backlash against them can be quite severe. But every day, people get a little bit bolder. The exhaustion and disillusionment has begun to outweigh the natural tendency to keep quiet and play along.",
    "103" : "What do these people object to? They’re tired of the prioritization of the symbolic over the substantive; of the  ever-more-obscure left-wing vocabulary; of the near-total silence on class issues; of the abandonment of labor organizing as a principal method of political action; of the insistence that people who aren’t already convinced must educate themselves, when convincing others is and has always been the basic requirement of political action; of the confusion of pop culture ephemera with meaningful political victory; of the celebrity worship; of the clumsy Manicheanism that divides the world into all good and all bad; of the use of cruelty, shaming, and character assassination; of the insistence that people within a political movement should “just listen” when someone makes a claim, no matter how outlandish, misguided, unfair, or wrong; of the expectation that everyone should know how to speak and act in perfect congruence with obscure and elitist conceptions of righteous behavior; of the profound conservatism of demanding that everyone occupy a narrow band of cultural practices, refusing to enjoy the world’s vast cultural bounties, out of fear of appropriating someone else’s culture; and, more than anything, of the willful obscurity and inaccessibility, the total and complete indifference towards actually reaching out and building a bigger movement by meeting people halfway and trying to adapt to them as you ask them to adapt to you, the replacement of a mass political movement with an exclusive social circle.",
    "104" : "I’m an academic, and a proud one, and many of my friends and family are academics, and I grew up within the academic left. But I’m perfectly willing to say that the academic turn within the American left — the way in which the university system has replaced the labor movement as the primary incubator of left-wing ideas — has been an unmitigated disaster. It has taken the materialist philosophies of socialism and corrupted them with a reality-denying postmodernism that prevents us from doing the basic work of politics, which is understanding reality and working to change it. It’s made the left’s behavior the behavior of a cloister, a political straitjacket that compels us to direct our appeals to a tiny fringe rather than to the vast world outside the campus walls. And in replicating that cloistered behavior on social media, the public face of the left has become synonymous with these obscure practices. Meanwhile, unable to articulate its value to the wider world thanks to these same pathologies, the humanities crumble within our universities, despite how badly the world needs them.",
    "105" : "Claims that doing yoga is impermissible cultural appropriation, arguments that we should drop phrases like “I see what you mean” because they’re ableist, the assumption that linking to Tweets constitutes violence but harassing and degrading people to the point of suicide is noble activism, filing Title IX claims against people for writing essays in major magazines, allowing your position to become synonymous with attacks on the right to free expression, claiming that you can fight capitalism and the state with hashtags — this is the behavior of a movement that cannot win. We cannot win that way.",
    "106" : "\"Getting past this stage will not be easy, and the recrimination and bitterness will be considerable. But the worm is turning, already. More and more people have come to realize that the left’s current way of engaging with the world is badly broken. In its place, we can build what we should always be working towards\" - \"a mass movement of people dedicated to achieving economic justice, to fighting racism and sexism and homophobia, to tearing down the brutal injustices of the drug war and the police state, to providing all people with material security, to ending labor exploitation, to building a social system founded on joint ownership of the productive apparatus of society by all, to creating a better world. We do that all through the only means that will ever work, which is convincing others that this effort is in their own best interest.\"",
    "107" : "It won’t be easy, and it won’t happen fast. On a personal level, resistance to this reform movement will be incredibly bitter. But that’s politics, and I haven’t seen any better suggestions. And in the meantime, I’m not going to get pushed off my spot, on this. I am not attacking the left. I’m trying to reform the left, to get the left to return to what it has always meant to be on the left. Many other people are, too, and if we’re going to actually achieve a better world, we need to win. And someday, we will.",
    "108" : " ",
    "109" : "Finding anything in Basecamp 3",
    "110" : "Working with people is messy — the more people, the messier it gets. There’s no way around that. And while you may know your own mess, finding something in someone else’s is quite a challenge.",
    "111" : "So we wanted to make sure Basecamp 3 made it easy to find what you’re looking for, no matter what fragments of information you may have handy. We’ve got every angle covered — sometimes from multiple angles!",
    "112" : "Let me play out a few real-world scenarios below and show you how Basecamp 3 makes it easy to find what you’re looking for — especially when you don’t know exactly what it is.",
    "113" : "“I know Jamie said something about that yesterday, but I don’t remember exactly how he said it or exactly where he said it.”",
    "114" : "Ever happen to you? You know someone said something somewhere, but you can’t remember exactly what it was or where they said it? Unless you can rifle through your memory for a keyword, A standard keyword search isn’t very helpful here.",
    "115" : "In Basecamp 3, just head into the “Find…” section, leave the keyword field blank, and just select “Comments” and then “Jamie Dihiansan” and hit “Go”. You’ll then get results showing everything Jamie commented on across every Basecamp you both have access to.",
    "116" : "Leave the keyword field blank, and just select “Comments” by “Jamie”. You could also have selected “Everything” rather than “Comments”, but that would show original source content, not responses to something someone else said.",
    "117" : "“Someone told me Ann’s been doing some amazing QA work lately. I’d love to see what she’s been up to.”",
    "118" : "I this case I’m not specifically looking for any one piece of content, or even anything specific — I’m just looking to find out where Ann’s been pitching in. It’s more about discovery than it is a traditional search.",
    "119" : "So I’d jump into the Reports menu and select “What has someone been up to…”",
    "120" : "Then type Ann…",
    "121" : "And then I get the “Here’s what Ann Goliak has been up to” report that shows everything she’s done on Basecamp in reverse chronological order. Comments she’s made, to-dos she’s added or completed, files/images she’s shared, deadlines she’s posted, etc. If she’s done it, it’s on this report. And now I know what Ann’s been up to!",
    "122" : "As you scroll down, you’d see any comments, messages, to-dos, files, schedule items, attachments, answers to automatic check-ins, and anything else Ann did.",
    "123" : "“Where are those sketches Ryan posted?”",
    "124" : "You know Ryan Singer’s been working on some concept lately, and he mentioned he shared some sketches in Basecamp. You don’t remember where or when exactly, only that they were sketches. Easy!",
    "125" : "Head into the “I’m looking for an image or file…” search on the Find screen.",
    "126" : "Image and file search has a special grid-UI dedicated to visual searching.",
    "127" : "Then just type in Ryan Singer. Now, I could have also selected “PDFs”, or “Video” or “All files” from the “Images” menu, but since I knew they were sketches, and I wanted to filter everything else out, I just selected Images.",
    "128" : "And now I see all the images Ryan has shared — no matter where they were shared (in a Campfire chat, in a message, in a document, attached to a to-do, attached to an event, it doesn’t matter). And there they are!",
    "129" : "Images -> Ryan Singer -> All Basecamp… And there they are!",
    "130" : "“I have no idea who shared it, or where they shared it, or what they called it, but I know someone put that PDF I need up on Basecamp.”",
    "131" : "This one happens all the time. You know it’s in Basecamp, you know it’s a PDF, you don’t know what it’s called, you aren’t even sure of what words to look for, you only know it was a PDF and you need it now! Easy!",
    "132" : "From the same “I’m looking for an image or file…” search in the previous example, just select “PDF” and leave everything else as it is. Then hit Go.",
    "133" : "You’ll get back a list of every PDF uploaded to Basecamp, most recent first. If you knew more info like who shared it, or which Basecamp it was in, or even a keyword, you could have entered that too to get more specific. But in a lot of cases you don’t know the specifics, you just know the generalities. Basecamp 3 has your covered.",
    "134" : "I don’t know what I’m looking for, I’m just looking.",
    "135" : "This one sounds kinda silly, but it’s very real and very common. You want to jump into a Basecamp and just have a look around. You’re in a discovery mindset. What’s happened today? What happened yesterday? Who said what? What topics did the conversations revolve around? Was there new work added to do? Was anything completed? Anyone share any visual concept or ideas I might want to check out? Who knows! You only know that you want to know.",
    "136" : "Basecamp 3 makes this super easy. For example, let’s say I wanted to see what’s been going on in Team OMG. “Team OMG” is our customer service’s Basecamp. I just visit their Basecamp and scroll down.",
    "137" : "An entire history of everything that ever happened in a Basecamp is always one screen scroll away on desktop or mobile. The latest stuff is on top. Just scroll down to go back in time and bump into what you’re looking for.",
    "138" : "At the bottom of every Basecamp is a full history log of everything that ever happened in that Basecamp — all the way back to day one. It’s basically everything flatted by time — new/completed to-dos, discussions, files that were shared, new documents, schedule items, comments, answers to automatic check-in questions — they are all here organized by time.",
    "139" : "Now, on top of all this you can of course search by keyword. That’s the easy one. You can also filter your searches just to a specific Basecamp, a specific person, a specific kind of content (“just search the schedule”), etc. But I hope the examples above give you a sense of some of the other ways you can find what you need in Basecamp 3!",
    "140" : "https://m.signalvnoise.com/finding-anything-in-basecamp-3-5a32077889f3#.6c405jit9",
    "141" : " ",
    "142" : "The next generation of Google Glass, Google's head-mounted wearable display, is the real deal.",
    "143" : "A filing to the Federal Communications Commission, the U.S. government body that must review and approve personal electronics like phones and wearables, reveals photos of the device's external design, along with internal circuitry (see below) and also a basic user manual. The filing also includes a statement on company letterhead authorizing a third party to help get Google through the FCC's authorization process.",
    "144" : "A new edition of Google Glass signals a possible new direction for the company's stalled and stagnant wearable, especially if it winds up in use as a business tool rather than as product for everyday buyers, as blog 9-to-5 Google reports.",
    "145" : "Named as model GG1 on the FCC documents, the device appears to hew closely to the original Google Glass Explorer Edition. In other words, it will look like a set of eyeglass frames with a screen floating above your eye.",
    "146" : "A previous patent from November depicts a version of Glass that looks like a squiggle of a device that would hug only half your head. Google apparently isn't ready for that future of Glass yet.",
    "148" : "Unconfirmed rumors from 9-to-5 Google and The Wall Street Journal suggest that the new edition of Google Glass will have a larger prism, a sturdier design and include an Intel Atom processor. It could sell directly to businesses.",
    "149" : "Google Glass has had a rough ride so far. Launched in 2012 for developers and then in 2013 for buyers, Google Glass was widely received as expensive and invasive, the latter because people feared they were being photographed or recorded without knowledge or permission. Google stopped selling its first Glass edition in January 2015.",
    "150" : "Google did not respond to a request for comment for this report.",
    "151" : "http://www.cnet.com/news/google-glass-2-0-is-real-photos",
    "152" : " ",
    "153" : "\"Jeremy\"",
    "154" : "At home",
    "155" : "Drawing pictures",
    "156" : "Of mountain tops",
    "157" : "With him on top",
    "158" : "Lemon yellow sun",
    "159" : "Arms raised in a V",
    "160" : "And the dead lay in pools of maroon below",
    "161" : "Daddy didn't give attention",
    "162" : "Oh, to the fact that mommy didn't care",
    "163" : "King Jeremy The Wicked",
    "164" : "Ruled his world",
    "165" : "Jeremy spoke in class today",
    "166" : "Jeremy spoke in class today",
    "167" : "Clearly I remember",
    "168" : "Pickin' on the boy",
    "169" : "Seemed a harmless little fuck",
    "170" : "But we unleashed a lion",
    "171" : "Gnashed his teeth",
    "172" : "And bit the recess lady's breast",
    "173" : "How could I forget",
    "174" : "And he hit me with a surprise left",
    "175" : "My jaw left hurting",
    "176" : "Dropped wide open",
    "177" : "Just like the day",
    "178" : "Oh, like the day I heard",
    "179" : "Daddy didn't give affection, no!",
    "180" : "And the boy was something that mommy wouldn't wear",
    "181" : "King Jeremy The Wicked",
    "182" : "Ruled his world",
    "183" : "Jeremy spoke in class today",
    "184" : "Jeremy spoke in class today",
    "185" : "Jeremy spoke in class today",
    "186" : "Try to forget this (try to forget this)",
    "187" : "Try to erase this (try to erase this)",
    "188" : "From the blackboard",
    "189" : "Jeremy spoke in class today",
    "190" : "Jeremy spoke in class today",
    "191" : "Jeremy spoke in, spoke in",
    "192" : "Jeremy spoke in, spoke in",
    "193" : "Jeremy spoke in class today",
    "end" : ""
}
